*** src/lib.rs:153:9: replace WorkloadGovernor::apply_for_issue with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::apply_for_issue with ()
@@ -145,31 +145,17 @@
     /// ```text
     /// stellar contract invoke --id <CONTRACT_ID> \
     ///   --network testnet --source <contributor-account> \
     ///   -- apply_for_issue \
     ///   --contributor <CONTRIBUTOR_ADDRESS> \
     ///   --org_id my_org --issue_id 42
     /// ```
     pub fn apply_for_issue(env: Env, contributor: Address, org_id: Symbol, issue_id: u32) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        contributor.require_auth();
-        let count = storage::get_global_app_count(&env, &contributor);
-        if count >= storage::GLOBAL_APP_LIMIT {
-            panic_with_error!(env, ContractError::GlobalApplicationLimitReached);
-        }
-        if storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
-            panic_with_error!(env, ContractError::DuplicateApplication);
-        }
-        storage::set_global_app_count(&env, &contributor, count + 1);
-        storage::set_app_entry(&env, &contributor, &org_id, issue_id);
-        storage::extend_global_app_count_ttl(&env, &contributor);
-        storage::extend_app_entry_ttl(&env, &contributor, &org_id, issue_id);
-        storage::bump_instance(&env);
-        events::emit_application_submitted(&env, &contributor, &org_id, issue_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Cancels a contributor's pending application for a specific issue.
     ///
     /// Removes the application sentinel and decrements the global application counter.
     /// If the counter reaches zero the counter entry itself is removed to free storage.
     ///
     /// # Who can call

---- test::prop_apply_round_trip stdout ----

thread 'test::prop_apply_round_trip' (66500) panicked at src/test.rs:464:1:
Test failed: assertion failed: client.has_applied(&contributor, &org, &issue_id) at src/test.rs:471.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (66501) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (66532) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::prop_apply_round_trip
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_duplicate_application_rejected
    test::prop_global_cap
    test::prop_global_cap_enforced
    test::prop_not_initialized_guard
    test::prop_org_assignment_cap_enforced
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::prop_withdraw_round_trip
    test::unit_error_already_assigned

test result: FAILED. 15 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.25s

*** result: Failure(101)
