*** src/lib.rs:156:18: replace >= with < in WorkloadGovernor::apply_for_issue

*** mutation diff:
--- src/lib.rs
+++ replace >= with < in WorkloadGovernor::apply_for_issue
@@ -148,17 +148,17 @@
     ///   -- apply_for_issue \
     ///   --contributor <CONTRIBUTOR_ADDRESS> \
     ///   --org_id my_org --issue_id 42
     /// ```
     pub fn apply_for_issue(env: Env, contributor: Address, org_id: Symbol, issue_id: u32) {
         storage::require_initialized(&env, &ContractError::NotInitialized);
         contributor.require_auth();
         let count = storage::get_global_app_count(&env, &contributor);
-        if count >= storage::GLOBAL_APP_LIMIT {
+        if count < /* ~ changed by cargo-mutants ~ */ storage::GLOBAL_APP_LIMIT {
             panic_with_error!(env, ContractError::GlobalApplicationLimitReached);
         }
         if storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
             panic_with_error!(env, ContractError::DuplicateApplication);
         }
         storage::set_global_app_count(&env, &contributor, count + 1);
         storage::set_app_entry(&env, &contributor, &org_id, issue_id);
         storage::extend_global_app_count_ttl(&env, &contributor);

---- test::prop_apply_round_trip stdout ----

thread 'test::prop_apply_round_trip' (66960) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", apply_for_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #6)], data:"escalating

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (66961) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", apply_for_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #6)], data:"escalati

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (66963) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #6)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #6)], data:["contract call failed", apply_for_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #6)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contra

failures:
    test::prop_apply_round_trip
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_duplicate_application_rejected
    test::prop_global_cap
    test::prop_global_cap_enforced
    test::prop_org_assignment_cap_enforced
    test::prop_read_only_queries_are_immutable
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::prop_unregistered_maintainer_rejected
    test::prop_withdraw_round_trip

test result: FAILED. 18 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.69s

*** result: Failure(101)
