*** src/lib.rs:162:65: replace + with * in WorkloadGovernor::apply_for_issue

*** mutation diff:
--- src/lib.rs
+++ replace + with * in WorkloadGovernor::apply_for_issue
@@ -154,17 +154,17 @@
         contributor.require_auth();
         let count = storage::get_global_app_count(&env, &contributor);
         if count >= storage::GLOBAL_APP_LIMIT {
             panic_with_error!(env, ContractError::GlobalApplicationLimitReached);
         }
         if storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
             panic_with_error!(env, ContractError::DuplicateApplication);
         }
-        storage::set_global_app_count(&env, &contributor, count + 1);
+        storage::set_global_app_count(&env, &contributor, count * /* ~ changed by cargo-mutants ~ */ 1);
         storage::set_app_entry(&env, &contributor, &org_id, issue_id);
         storage::extend_global_app_count_ttl(&env, &contributor);
         storage::extend_app_entry_ttl(&env, &contributor, &org_id, issue_id);
         storage::bump_instance(&env);
         events::emit_application_submitted(&env, &contributor, &org_id, issue_id);
     }
 
     /// Cancels a contributor's pending application for a specific issue.

---- test::prop_apply_round_trip stdout ----

thread 'test::prop_apply_round_trip' (67798) panicked at src/test.rs:464:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/test.rs:472.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (67799) panicked at src/test.rs:552:76:
attempt to subtract with overflow

thread 'test::prop_assign_round_trip' (67799) panicked at src/test.rs:552:76:
attempt to subtract with overflow

thread 'test::prop_assign_round_trip' (67799) panicked at src/test.rs:552:76:
attempt to subtract with overflow

thread 'test::prop_assign_round_trip' (67799) panicked at src/test.rs:552:76:
attempt to subtract with overflow

---- test::prop_global_cap stdout ----

thread 'test::prop_global_cap' (67855) panicked at src/test.rs:624:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/test.rs:660.
minimal failing input: actions = [
    (
        true,
        0,
    ),
]
	successes: 0
	local rejects: 0

failures:
    test::prop_apply_round_trip
    test::prop_assign_round_trip
    test::prop_global_cap
    test::prop_global_cap_enforced
    test::unit_error_global_application_limit_reached
    test::unit_full_lifecycle
    test::unit_withdraw_application

test result: FAILED. 30 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 15.34s

*** result: Failure(101)
