*** src/lib.rs:201:9: replace WorkloadGovernor::withdraw_application with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::withdraw_application with ()
@@ -193,31 +193,17 @@
     /// ```text
     /// stellar contract invoke --id <CONTRACT_ID> \
     ///   --network testnet --source <contributor-account> \
     ///   -- withdraw_application \
     ///   --contributor <CONTRIBUTOR_ADDRESS> \
     ///   --org_id my_org --issue_id 42
     /// ```
     pub fn withdraw_application(env: Env, contributor: Address, org_id: Symbol, issue_id: u32) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        contributor.require_auth();
-        if !storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
-            panic_with_error!(env, ContractError::ApplicationNotFound);
-        }
-        storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
-        let count = storage::get_global_app_count(&env, &contributor);
-        let new_count = count.saturating_sub(1);
-        if new_count == 0 {
-            storage::remove_global_app_count(&env, &contributor);
-        } else {
-            storage::set_global_app_count(&env, &contributor, new_count);
-        }
-        storage::bump_instance(&env);
-        events::emit_application_withdrawn(&env, &contributor, &org_id, issue_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     // -----------------------------------------------------------------------
     // Maintainer functions
     // -----------------------------------------------------------------------
 
     /// Converts a pending application into an active assignment (maintainer-only).
     ///

---- test::prop_global_cap stdout ----

thread 'test::prop_global_cap' (68499) panicked at src/test.rs:624:1:
Test failed: assertion failed: `(left == right)` 
  left: `1`,
 right: `0` at src/test.rs:670.
minimal failing input: actions = [
    (
        true,
        5,
    ),
    (
        false,
        5,

---- test::prop_withdraw_round_trip stdout ----

thread 'test::prop_withdraw_round_trip' (68756) panicked at src/test.rs:491:1:
Test failed: assertion failed: !client.has_applied(&contributor, &org, &issue_id) at src/test.rs:499.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::unit_error_application_not_found_withdraw stdout ----
note: test did not panic as expected at src/test.rs:289:4

failures:
    test::prop_global_cap
    test::prop_withdraw_round_trip
    test::unit_error_application_not_found_withdraw
    test::unit_saturating_sub_zero_floor_global
    test::unit_withdraw_application

test result: FAILED. 32 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 20.63s

*** result: Failure(101)
