*** src/lib.rs:203:12: delete ! in WorkloadGovernor::withdraw_application

*** mutation diff:
--- src/lib.rs
+++ delete ! in WorkloadGovernor::withdraw_application
@@ -195,17 +195,17 @@
     ///   --network testnet --source <contributor-account> \
     ///   -- withdraw_application \
     ///   --contributor <CONTRIBUTOR_ADDRESS> \
     ///   --org_id my_org --issue_id 42
     /// ```
     pub fn withdraw_application(env: Env, contributor: Address, org_id: Symbol, issue_id: u32) {
         storage::require_initialized(&env, &ContractError::NotInitialized);
         contributor.require_auth();
-        if !storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
+        if  /* ~ changed by cargo-mutants ~ */storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
             panic_with_error!(env, ContractError::ApplicationNotFound);
         }
         storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
         let count = storage::get_global_app_count(&env, &contributor);
         let new_count = count.saturating_sub(1);
         if new_count == 0 {
             storage::remove_global_app_count(&env, &contributor);
         } else {

---- test::prop_global_cap stdout ----

thread 'test::prop_global_cap' (69232) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", withdraw_application, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, seq, 7]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"escalating error to pa

---- test::prop_withdraw_round_trip stdout ----

thread 'test::prop_withdraw_round_trip' (69465) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", withdraw_application, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:

---- test::unit_error_application_not_found_withdraw stdout ----
note: test did not panic as expected at src/test.rs:289:4

failures:
    test::prop_global_cap
    test::prop_withdraw_round_trip
    test::unit_error_application_not_found_withdraw
    test::unit_saturating_sub_zero_floor_global
    test::unit_withdraw_application

test result: FAILED. 32 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.14s

*** result: Failure(101)
