*** src/lib.rs:209:22: replace == with != in WorkloadGovernor::withdraw_application

*** mutation diff:
--- src/lib.rs
+++ replace == with != in WorkloadGovernor::withdraw_application
@@ -201,17 +201,17 @@
         storage::require_initialized(&env, &ContractError::NotInitialized);
         contributor.require_auth();
         if !storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
             panic_with_error!(env, ContractError::ApplicationNotFound);
         }
         storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
         let count = storage::get_global_app_count(&env, &contributor);
         let new_count = count.saturating_sub(1);
-        if new_count == 0 {
+        if new_count != /* ~ changed by cargo-mutants ~ */ 0 {
             storage::remove_global_app_count(&env, &contributor);
         } else {
             storage::set_global_app_count(&env, &contributor, new_count);
         }
         storage::bump_instance(&env);
         events::emit_application_withdrawn(&env, &contributor, &org_id, issue_id);
     }

---- test::prop_global_cap stdout ----

thread 'test::prop_global_cap' (69924) panicked at src/test.rs:624:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/test.rs:670.
minimal failing input: actions = [
    (
        true,
        5,
    ),
    (
        true,
        0,

failures:
    test::prop_global_cap

test result: FAILED. 36 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.13s

*** result: Failure(101)
