*** src/lib.rs:264:9: replace WorkloadGovernor::assign_issue with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::assign_issue with ()
@@ -256,44 +256,17 @@
     /// ```
     pub fn assign_issue(
         env: Env,
         maintainer: Address,
         contributor: Address,
         org_id: Symbol,
         issue_id: u32,
     ) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        maintainer.require_auth();
-        if !storage::is_maintainer(&env, &maintainer, &org_id) {
-            panic_with_error!(env, ContractError::UnauthorizedMaintainer);
-        }
-        if !storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
-            panic_with_error!(env, ContractError::ApplicationNotFound);
-        }
-        let asgn_count = storage::get_org_assignment_count(&env, &contributor, &org_id);
-        if asgn_count >= storage::ORG_ASSIGNMENT_LIMIT {
-            panic_with_error!(env, ContractError::OrgAssignmentLimitReached);
-        }
-        if storage::has_assignment(&env, &org_id, issue_id, &contributor) {
-            panic_with_error!(env, ContractError::AlreadyAssigned);
-        }
-        // Transition: consume the application, create the assignment
-        storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
-        let app_count = storage::get_global_app_count(&env, &contributor);
-        let new_app_count = app_count.saturating_sub(1);
-        if new_app_count == 0 {
-            storage::remove_global_app_count(&env, &contributor);
-        } else {
-            storage::set_global_app_count(&env, &contributor, new_app_count);
-        }
-        storage::set_org_assignment_count(&env, &contributor, &org_id, asgn_count + 1);
-        storage::set_assignment(&env, &org_id, issue_id, &contributor);
-        storage::bump_instance(&env);
-        events::emit_issue_assigned(&env, &maintainer, &contributor, &org_id, issue_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Marks an active assignment as completed and frees the assignment slot (maintainer-only).
     ///
     /// Removes the assignment sentinel and decrements the contributor's org-level
     /// assignment counter. If the counter reaches zero the counter entry itself is removed.
     ///
     /// # Who can call

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (70621) panicked at src/test.rs:541:1:
Test failed: assertion failed: !client.has_applied(&contributor, &org, &issue_id) at src/test.rs:550.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (70631) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #10)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #10)], data:["contract call failed", complete_assignment, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #10)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAA

---- test::prop_org_assignment_cap_enforced stdout ----

thread 'test::prop_org_assignment_cap_enforced' (71209) panicked at src/test.rs:520:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `4` at src/test.rs:530.
minimal failing input: org_name = "a"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_org_assignment_cap_enforced
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::prop_unregistered_maintainer_rejected
    test::unit_error_application_not_found_assign
    test::unit_error_org_assignment_limit_reached
    test::unit_error_unauthorized_maintainer
    test::unit_full_lifecycle
    test::unit_multi_org_independent_limits
    test::unit_revoke_lifecycle

test result: FAILED. 24 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 289.02s

*** result: Failure(101)
