*** src/lib.rs:269:12: delete ! in WorkloadGovernor::assign_issue

*** mutation diff:
--- src/lib.rs
+++ delete ! in WorkloadGovernor::assign_issue
@@ -261,17 +261,17 @@
         org_id: Symbol,
         issue_id: u32,
     ) {
         storage::require_initialized(&env, &ContractError::NotInitialized);
         maintainer.require_auth();
         if !storage::is_maintainer(&env, &maintainer, &org_id) {
             panic_with_error!(env, ContractError::UnauthorizedMaintainer);
         }
-        if !storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
+        if  /* ~ changed by cargo-mutants ~ */storage::has_app_entry(&env, &contributor, &org_id, issue_id) {
             panic_with_error!(env, ContractError::ApplicationNotFound);
         }
         let asgn_count = storage::get_org_assignment_count(&env, &contributor, &org_id);
         if asgn_count >= storage::ORG_ASSIGNMENT_LIMIT {
             panic_with_error!(env, ContractError::OrgAssignmentLimitReached);
         }
         if storage::has_assignment(&env, &org_id, issue_id, &contributor) {
             panic_with_error!(env, ContractError::AlreadyAssigned);

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (76057) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (76072) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 997]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::prop_org_assignment_cap_enforced stdout ----

thread 'test::prop_org_assignment_cap_enforced' (76658) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #9)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #9)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, efnhpk, 0]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #9)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_org_assignment_cap_enforced
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::unit_error_application_not_found_assign
    test::unit_full_lifecycle
    test::unit_multi_org_independent_limits
    test::unit_revoke_lifecycle
    test::unit_saturating_sub_zero_floor_org

test result: FAILED. 27 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 296.86s

*** result: Failure(101)
