*** src/lib.rs:288:83: replace + with - in WorkloadGovernor::assign_issue

*** mutation diff:
--- src/lib.rs
+++ replace + with - in WorkloadGovernor::assign_issue
@@ -280,17 +280,17 @@
         storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
         let app_count = storage::get_global_app_count(&env, &contributor);
         let new_app_count = app_count.saturating_sub(1);
         if new_app_count == 0 {
             storage::remove_global_app_count(&env, &contributor);
         } else {
             storage::set_global_app_count(&env, &contributor, new_app_count);
         }
-        storage::set_org_assignment_count(&env, &contributor, &org_id, asgn_count + 1);
+        storage::set_org_assignment_count(&env, &contributor, &org_id, asgn_count - /* ~ changed by cargo-mutants ~ */ 1);
         storage::set_assignment(&env, &org_id, issue_id, &contributor);
         storage::bump_instance(&env);
         events::emit_issue_assigned(&env, &maintainer, &contributor, &org_id, issue_id);
     }
 
     /// Marks an active assignment as completed and frees the assignment slot (maintainer-only).
     ///
     /// Removes the assignment sentinel and decrements the contributor's org-level

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (82042) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(WasmVm, InvalidAction)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 521]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(WasmVm, InvalidAction)], data:"caught error from function"
   4: [Diagnostic Event] topics:[fn_call, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (82052) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(WasmVm, InvalidAction)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 521]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(WasmVm, InvalidAction)], data:"caught error from function"
   4: [Diagnostic Event] topics:[fn_call, CAAAAAAAAAA

---- test::prop_org_assignment_cap_enforced stdout ----

thread 'test::prop_org_assignment_cap_enforced' (82400) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(WasmVm, InvalidAction)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(WasmVm, InvalidAction)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 0]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(WasmVm, InvalidAction)], data:"caught error from function"
   4: [Diagnostic Event] topics:[fn_call, CAAAAAAAAAAAAAAAA

failures:
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_org_assignment_cap_enforced
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::unit_full_lifecycle
    test::unit_multi_org_independent_limits
    test::unit_revoke_lifecycle
    test::unit_saturating_sub_zero_floor_org

test result: FAILED. 28 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 302.37s

*** result: Failure(101)
