*** src/lib.rs:288:83: replace + with * in WorkloadGovernor::assign_issue

*** mutation diff:
--- src/lib.rs
+++ replace + with * in WorkloadGovernor::assign_issue
@@ -280,17 +280,17 @@
         storage::remove_app_entry(&env, &contributor, &org_id, issue_id);
         let app_count = storage::get_global_app_count(&env, &contributor);
         let new_app_count = app_count.saturating_sub(1);
         if new_app_count == 0 {
             storage::remove_global_app_count(&env, &contributor);
         } else {
             storage::set_global_app_count(&env, &contributor, new_app_count);
         }
-        storage::set_org_assignment_count(&env, &contributor, &org_id, asgn_count + 1);
+        storage::set_org_assignment_count(&env, &contributor, &org_id, asgn_count * /* ~ changed by cargo-mutants ~ */ 1);
         storage::set_assignment(&env, &org_id, issue_id, &contributor);
         storage::bump_instance(&env);
         events::emit_issue_assigned(&env, &maintainer, &contributor, &org_id, issue_id);
     }
 
     /// Marks an active assignment as completed and frees the assignment slot (maintainer-only).
     ///
     /// Removes the assignment sentinel and decrements the contributor's org-level

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (87258) panicked at src/test.rs:541:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/test.rs:553.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_org_assignment_cap_enforced stdout ----

thread 'test::prop_org_assignment_cap_enforced' (87904) panicked at src/test.rs:520:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `4` at src/test.rs:530.
minimal failing input: org_name = "a"
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_storage_key_collision_freedom stdout ----

thread 'test::prop_storage_key_collision_freedom' (88068) panicked at src/test.rs:941:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    test::prop_assign_round_trip
    test::prop_org_assignment_cap_enforced
    test::prop_storage_key_collision_freedom
    test::unit_error_org_assignment_limit_reached
    test::unit_full_lifecycle
    test::unit_multi_org_independent_limits

test result: FAILED. 31 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 291.29s

*** result: Failure(101)
