*** src/lib.rs:322:9: replace WorkloadGovernor::complete_assignment with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::complete_assignment with ()
@@ -314,34 +314,17 @@
     /// * [`ContractError::AssignmentNotFound`]     — no active assignment exists for the triple.
     pub fn complete_assignment(
         env: Env,
         maintainer: Address,
         contributor: Address,
         org_id: Symbol,
         issue_id: u32,
     ) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        maintainer.require_auth();
-        if !storage::is_maintainer(&env, &maintainer, &org_id) {
-            panic_with_error!(env, ContractError::UnauthorizedMaintainer);
-        }
-        if !storage::has_assignment(&env, &org_id, issue_id, &contributor) {
-            panic_with_error!(env, ContractError::AssignmentNotFound);
-        }
-        storage::remove_assignment(&env, &org_id, issue_id, &contributor);
-        let asgn_count = storage::get_org_assignment_count(&env, &contributor, &org_id);
-        let new_count = asgn_count.saturating_sub(1);
-        if new_count == 0 {
-            storage::remove_org_assignment_count(&env, &contributor, &org_id);
-        } else {
-            storage::set_org_assignment_count(&env, &contributor, &org_id, new_count);
-        }
-        storage::bump_instance(&env);
-        events::emit_assignment_completed(&env, &maintainer, &contributor, &org_id, issue_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Cancels an active assignment and frees the assignment slot (maintainer-only).
     ///
     /// Semantically identical to [`WorkloadGovernor::complete_assignment`] except the emitted
     /// event is `assignment_revoked` rather than `assignment_completed`. Use this when a
     /// contributor's work is being cancelled rather than accepted.
     ///

---- test::prop_assignment_not_found stdout ----

thread 'test::prop_assignment_not_found' (87681) panicked at src/test.rs:588:1:
Test failed: assertion failed: result.is_err() at src/test.rs:597.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (87682) panicked at src/test.rs:558:1:
Test failed: assertion failed: !client.is_assigned(&contributor, &org, &issue_id) at src/test.rs:567.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::unit_error_assignment_not_found_complete stdout ----
note: test did not panic as expected at src/test.rs:315:4

failures:
    test::prop_assignment_not_found
    test::prop_complete_is_inverse_of_assign
    test::unit_error_assignment_not_found_complete
    test::unit_full_lifecycle
    test::unit_saturating_sub_zero_floor_org

test result: FAILED. 32 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 288.32s

*** result: Failure(101)
