*** src/lib.rs:371:9: replace WorkloadGovernor::revoke_assignment with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::revoke_assignment with ()
@@ -363,34 +363,17 @@
     /// * [`ContractError::AssignmentNotFound`]     — no active assignment exists for the triple.
     pub fn revoke_assignment(
         env: Env,
         maintainer: Address,
         contributor: Address,
         org_id: Symbol,
         issue_id: u32,
     ) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        maintainer.require_auth();
-        if !storage::is_maintainer(&env, &maintainer, &org_id) {
-            panic_with_error!(env, ContractError::UnauthorizedMaintainer);
-        }
-        if !storage::has_assignment(&env, &org_id, issue_id, &contributor) {
-            panic_with_error!(env, ContractError::AssignmentNotFound);
-        }
-        storage::remove_assignment(&env, &org_id, issue_id, &contributor);
-        let asgn_count = storage::get_org_assignment_count(&env, &contributor, &org_id);
-        let new_count = asgn_count.saturating_sub(1);
-        if new_count == 0 {
-            storage::remove_org_assignment_count(&env, &contributor, &org_id);
-        } else {
-            storage::set_org_assignment_count(&env, &contributor, &org_id, new_count);
-        }
-        storage::bump_instance(&env);
-        events::emit_assignment_revoked(&env, &maintainer, &contributor, &org_id, issue_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     // -----------------------------------------------------------------------
     // TTL management
     // -----------------------------------------------------------------------
 
     /// Resets the TTL of a contributor's pending application entries to the full wave
     /// duration (permissionless — anyone can call this to prevent an application expiring).

---- test::prop_revoke_is_inverse_of_assign stdout ----

thread 'test::prop_revoke_is_inverse_of_assign' (99476) panicked at src/test.rs:573:1:
Test failed: assertion failed: !client.is_assigned(&contributor, &org, &issue_id) at src/test.rs:582.
minimal failing input: org_name = "a", issue_id = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- test::unit_error_assignment_not_found_revoke stdout ----
note: test did not panic as expected at src/test.rs:329:4

---- test::unit_revoke_lifecycle stdout ----

thread 'test::unit_revoke_lifecycle' (99601) panicked at src/test.rs:90:5:
assertion failed: !t.client.is_assigned(&contributor, &org, &42u32)

failures:
    test::prop_revoke_is_inverse_of_assign
    test::unit_error_assignment_not_found_revoke
    test::unit_revoke_lifecycle

test result: FAILED. 34 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 297.46s

*** result: Failure(101)
