*** src/lib.rs:55:9: replace WorkloadGovernor::initialize with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::initialize with ()
@@ -47,23 +47,17 @@
     ///
     /// # Examples
     /// ```text
     /// stellar contract invoke --id <CONTRACT_ID> \
     ///   --network testnet --source <admin-account> \
     ///   -- initialize --admin <ADMIN_ADDRESS>
     /// ```
     pub fn initialize(env: Env, admin: Address) {
-        if storage::get_admin(&env).is_some() {
-            panic_with_error!(env, ContractError::AlreadyInitialized);
-        }
-        admin.require_auth();
-        storage::set_admin(&env, &admin);
-        storage::bump_instance(&env);
-        events::emit_initialized(&env, &admin);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Authorises a maintainer to manage issues within a specific organisation.
     /// The operation is idempotent — calling it twice for the same pair is safe.
     ///
     /// # Who can call
     /// The stored admin address only.
     ///

---- test::prop_apply_round_trip stdout ----

thread 'test::prop_apply_round_trip' (56609) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", apply_for_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, azb, 728]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #2)], data:"escalating er

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (56610) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", register_maintainer, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, efnhpk]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::prop_assignment_not_found stdout ----

thread 'test::prop_assignment_not_found' (56625) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #2)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #2)], data:["contract call failed", register_maintainer, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCT4, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, azb]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #2)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::prop_apply_round_trip
    test::prop_assign_round_trip
    test::prop_assignment_not_found
    test::prop_complete_is_inverse_of_assign
    test::prop_duplicate_application_rejected
    test::prop_global_cap
    test::prop_global_cap_enforced
    test::prop_org_assignment_cap_enforced
    test::prop_read_only_queries_are_immutable
    test::prop_register_maintainer_idempotent
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom

test result: FAILED. 13 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.51s

*** result: Failure(101)
