*** src/lib.rs:83:9: replace WorkloadGovernor::register_maintainer with ()

*** mutation diff:
--- src/lib.rs
+++ replace WorkloadGovernor::register_maintainer with ()
@@ -75,22 +75,17 @@
     /// # Returns
     /// `()` on success.
     ///
     /// # Errors
     /// * [`ContractError::NotInitialized`]   — contract has not been initialised yet.
     /// * [`ContractError::UnauthorizedAdmin`] — `admin` auth check fails (enforced by
     ///   `require_auth` on the stored admin, not a direct comparison).
     pub fn register_maintainer(env: Env, admin: Address, maintainer: Address, org_id: Symbol) {
-        storage::require_initialized(&env, &ContractError::NotInitialized);
-        let stored_admin = storage::get_admin(&env).unwrap();
-        stored_admin.require_auth();
-        storage::set_maintainer(&env, &maintainer, &org_id);
-        storage::bump_instance(&env);
-        events::emit_maintainer_registered(&env, &admin, &maintainer, &org_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Upgrades the contract WASM to a new hash (admin-only).
     ///
     /// This is the standard Soroban upgrade path. The new WASM must already be
     /// uploaded to the network before calling this function.
     ///
     /// # Who can call

---- test::prop_assign_round_trip stdout ----

thread 'test::prop_assign_round_trip' (63234) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 521]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM,

---- test::prop_complete_is_inverse_of_assign stdout ----

thread 'test::prop_complete_is_inverse_of_assign' (63257) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 521]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

---- test::prop_org_assignment_cap_enforced stdout ----

thread 'test::prop_org_assignment_cap_enforced' (63464) panicked at /home/codespace/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/soroban-env-host-22.1.3/src/host.rs:847:9:
HostError: Error(Contract, #4)

Event log (newest first):
   0: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:"escalating error to panic"
   1: [Diagnostic Event] topics:[error, Error(Contract, #4)], data:["contract call failed", assign_issue, [CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHK3M, CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAITA4, pw, 0]]
   2: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAD2KM, topics:[error, Error(Contract, #4)], data:"caught error from function"
   3: [Failed Diagnostic Event (not emitted)] contract:CAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

failures:
    test::prop_assign_round_trip
    test::prop_complete_is_inverse_of_assign
    test::prop_org_assignment_cap_enforced
    test::prop_revoke_is_inverse_of_assign
    test::prop_storage_key_collision_freedom
    test::unit_error_not_initialized_register
    test::unit_full_lifecycle
    test::unit_multi_org_independent_limits
    test::unit_revoke_lifecycle
    test::unit_saturating_sub_zero_floor_org

test result: FAILED. 27 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 309.79s

*** result: Failure(101)
